Tekla Open API Reference for Tekla Structures 2025
Task.Scenario Property
 The scenario which the task belongs to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public HierarchicObject Scenario { get; set; }
Public Property Scenario As HierarchicObject
	Get
	Set
Property Value
Type: HierarchicObject
See Also
Reference
Task Class
Tekla.Structures.Model Namespace